{
  "drawer": {
    "title": "Drawer",
    "model": "models/drawer.glb",
    "images": ["images/drawer_2.jpg", "images/drawer_3.jpg"],
    "text": "<p>An opportunity was created after an obsolete radio was removed from my father’s Mooney M20M plane. The now-empty slot in the avionics bay was a hazard for debris getting dropped inside, and would normally be covered up with a simple plate. However in order to put the space to good use, I had the idea to create a small drawer which could be used to store small objects. Snacks, pens, phones, and wallets would have a convenient place to go - within reach, but out of the way in the compact cockpit.</p>\n\n<p>The first issue to solve was heating. During operation, the avionics bay would heat tremendously, beyond the operating temperature of most normal 3D-printing filaments. Therefore, I decided to use a nylon alloy filament, PolyMaker’s “CoPa”. Though this added expense and complications during printing, the operating temperature of 180C was more than enough to take the heat during use. Secondly, the drawer needed a way to lock inside the bay, so it would not open during critical parts of flight. After considering methods such as screws and velcro, I finally settled on a latch mechanism, which engages a cutout in the sheet metal cavity.</p>\n\n<p>After two prototypes were tested, the final drawer fit perfectly and latched securely into the empty space. It has been used on numerous flights without fail, and while the interior gets very warm, it remains strong and shock-resistant. The heat even can warm up some snacks during flight, and continues to provide perfect functionality as a safe and convenient storage space.</p>",
    "category": ["CAD", "Manufacturing"]
  },
  "ironSights": {
    "title": "Iron Sights",
    "model": "models/si.glb",
    "images": ["images/sights_1.jpg", "images/sights_2.jpg", "images/sights_3.jpg"],
    "text": "<p>A member of my University's shooting club had a dilemma. He had a new rifle, but no scope to mount to it. As this particular model of rifle was not manufactured with iron sights included, it would be impossible to shoot until some sighting solution was found. I therefore decided to work with him to design and 3D-print a set of “iron” sights for the rifle, which would provide a stopgap solution until a scope was bought. After brainstorming design criteria and noting critical measurements, I created prototypes in SolidWorks to print and test. The project took around two months, as numerous attempts were made in order to meet the tight tolerances of the rifle and incorporate new ideas.</p><p>The final design is composed of three major sections, with a few smaller parts such as nuts and bolts making them up. All plastic components were printed using EcoTough PLA filament, which proved to be more than sufficient for the task. The appearance of the sights is styled after the WW-II era Type 99 Arisaka rifle (a personal preference), using a front blade combined with a swappable rear aperture/notch to aim. While the front sight is tightened to the sling swivel of the rifle and remains immovable, the rear sight is adjustable for both windage and elevation (horizontal and vertical motion). With a hex key, the sight can therefore be adjusted to properly zero the rifle and compensate for changes in distance to the target.</p> <p>During a field test, the sights worked as intended, hitting targets up to to 100m away. While not as accurate as a scope, the sights serve their temporary purpose well. Most importantly, this project provided a fun application for 3D design, and a good opportunity to practice.</p>",
    "category": ["CAD", "Manufacturing"]
  },
  "monitorStand": {
    "title": "Monitor Stand",
    "model": "models/ms.glb",
    "images": ["images/monitorstand_2.jpg"],
    "text": "<p>A friend approached me with a rather simple problem: his desktop monitor was sitting too low on his desk. While the straightforward solution would be to prop it up with textbooks, I took the opportunity to design him a more permanent one As the stand needed to be the size of the monitor base, this ended up being the largest 3D print I’ve done and just barely fit on the printer. Given that the only mechanical requirement of the stand was to support a single, vertical load while taking up space, I took the opportunity to experiment with solidworks and create a more organic, aesthetically-oriented design.</p>\n\n<p>This project gave me further insights into what is possible with 3D modelling, and strengthened my confidence in printing larger objects. The stand functions perfectly (printed out of PLA), and serves a secondary purpose as an artistic touch to the room.</p>",
    "category": ["CAD", "Manufacturing"]

  },
  "opalNecklace": {
    "title": "Opal Necklace",
    "model": "models/on.glb",
    "images": ["images/opal_1.jpg", "images/opal_2.jpg"],
    "text": "<p>Many of the modeling projects I work on are primarily focused on technical design. Fit, function, and efficiency are generally far more crucial considerations when compared to aesthetics. However, I had much more artistic liberty when I decided to design a pendant as a gift for my girlfriend. This freedom was a first for me, as was the method of production. Rather than manufacture the pendant myself, I tried the online manufacturing service provided by Shapeways.</p>\n\n<p>After I created the model, it was sent to their facility and 3D printed in wax, before being cast out of silver. As I did not have access to my forge or workshop at the time, Shapeways was my only way to create parts out of metal. This was an excellent learning experience for me, as I got my first chance to create organic structures in SolidWorks and try new features. It also proved to me the viability of using online manufacturing, which greatly expands the variety of things I can make. But most importantly, once combined with a small opal, it made a great christmas present which continues to see use.</p>",
    "category": ["CAD", "Manufacturing"]
  },
  "tourniquet": {
    "title": "Tourniquet",
    "model": "",
    "images": ["images/tourniquet_1.jpg"],
    "text": "<p>Medical supplies have always been of particular interest to me, owing to their sheer importance. Medical response is a vital task, and I have learned through my first aid courses that proper equipment and training can quite literally save a life. However, many medical devices are beyond the capacity of hobbyist manufacture due to the stringent sterilization, tolerance, and testing requirements. Therefore, when I heard about <a href=”https://glia.org/” target=”_blank”>Glia</a> 3D printing medical supplies, I was extremely intrigued.</p>\n\n<p>After emailing one of the doctors in the group, I was linked to their files for a partially 3D printed tourniquet. A tourniquet is a device which cuts off blood flow to a limb, stopping severe bleeding. I did not have one in my first aid kit, and while they are a niche item, they can sometimes be the only solution to sever limb trauma. I therefore set about purchasing the necessary fabrics and setting the models to print. I modified and strengthened the models to print with a different material (PLA instead of ABS), and made some concessions while sewing. However, the end result seems to function perfectly. While I hope that I will never need to use it, it’s good to know that some medical equipment can be improvised, should the need arise.</p>",
    "category": ["Manufacturing"]
  },
  "faceShields": {
    "title": "Face Shields",
    "images": ["images/faceshield_2.jpg"],
    "model": "",
    "text": "<p>The COVID-19 pandemic has been wreaking havoc on the world, particularly the healthcare system. Many essential medical devices are in short supply at the moment, and a large demand for replacements exists. While some items such as ventilators and masks require fairly complex facilities to produce, the flexible manufacturing provided by 3D printers can help to make simpler parts. Prusa Research designed a 3D-printable face shield which has seen somewhat widespread adoption when traditionally manufactured alternatives are no longer available.</p><p>Therefore, when Inksmith LTD ran a donation drive in my area to collect parts for these face shields, I decided to try my hand at producing some. Using my Prusa MK3S and a Creality CR-10S 3D-printer over the course of a week, I spent most of my filament in constant printing. This was done using many different brands and plastics, including PLA, XT, and PETG. While each type required tweaking in order to optimize both print quality and speed, the result was enough parts for 60 functional face shields. Though certainly not ideal, once assembled and in the right hands they should provide a basic level of protection from the virus.</p>",
    "category": ["Manufacturing"]
  }
}
